In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("datasets/food_prices.csv")

In [4]:
df

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015

In [13]:
df = pd.read_csv("datasets/food_prices1.csv",sep='\t')

In [14]:
df

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015

In [17]:
df = pd.read_csv("datasets/food_prices2.csv",sep='|', header = None ,names = ["Product","Store","Price","Year"] )
df

  Product Store  Price  Year
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015

In [21]:
df = pd.read_csv("datasets/food_prices3.csv",skiprows=2, header=None , names =["prod",'shop','price','date'])
df

     prod shop  price  date
0    pear    A   0.99  2017
1    pear    B   1.99  2017
2   peach    A   2.99  2017
3   peach    B   3.49  2017
4  banana    A   0.39  2017
5  banana    B   0.49  2017
6   steak    A   5.99  2017
7   steak    B   6.99  2017
8   steak    B   4.99  2015

In [24]:
df = pd.read_csv("datasets/food_prices4.csv",comment="#")

In [25]:
df

     item store  price  Date
0    pear     A   0.99  2017
1    pear     B   1.99  2017
2   peach     A   2.99  2017
3   peach     B   3.49  2017
4  banana     A   0.39  2017
5  banana     B   0.49  2017
6   steak     A   5.99  2017
7   steak     B   6.99  2017
8   steak     B   4.99  2015

In [34]:
df = pd.read_csv("datasets/food_prices.csv",usecols = [0,3])

In [35]:
df

     item  Date
0    pear  2017
1    pear  2017
2   peach  2017
3   peach  2017
4  banana  2017
5  banana  2017
6   steak  2017
7   steak  2017
8   steak  2015